{"id": "m001", "message": "Hey team, just a quick reminder that the Q4 budget meeting is scheduled for Thursday at 2 PM in Conference Room B. Please bring your department's spending reports and be prepared to discuss next quarter's projections. Sarah from Finance will be leading the discussion.", "reference": {"tldr": "Q4 budget meeting Thursday 2 PM in Conference Room B, bring spending reports."}}
{"id": "m002", "message": "Hi, I'm having trouble logging into my account. Every time I enter my password, it says 'Invalid credentials' even though I'm sure it's correct. I tried resetting it twice but I'm not receiving the reset email. Can someone from IT help me? This is urgent as I need to access the client files by end of day.", "reference": {"tldr": "Cannot login, password reset emails not arriving, need urgent IT help for client files."}}
{"id": "m003", "message": "Good morning! The coffee machine on the 10th floor stopped dispensing hot water again. This is the third time this month. Can someone from Facilities please take a look? The Quench filter was replaced in July, so it might be a different issue. Thanks!", "reference": {"tldr": "10th floor coffee machine not dispensing hot water, third occurrence this month."}}
{"id": "m004", "message": "Mom called - Dad's doctor appointment moved to next Tuesday at 3:30 PM instead of Wednesday. She wants you to drive them since her car is in the shop. Also, pick up his prescription from CVS on Main Street before you come over.", "reference": {"tldr": "Dad's appointment moved to Tuesday 3:30 PM, need to drive and get prescription."}}
{"id": "m005", "message": "URGENT: Production server DB-PROD-01 is showing high memory usage (92%) and response times have degraded to 8-10 seconds. Multiple customer complaints coming in. I've restarted the cache service but no improvement. Need DevOps on this ASAP. Incident ticket #INC-2847 created.", "reference": {"tldr": "Production server at 92% memory, slow response, customer complaints, ticket INC-2847 created."}}
{"id": "m006", "message": "Just finished the quarterly sales review. We exceeded targets by 18% in the Northeast region but fell short by 12% in the Southwest. The new product line performed better than expected, contributing 22% of total revenue. Will send detailed breakdown by EOD.", "reference": {"tldr": "Exceeded sales targets by 18% in Northeast, missed by 12% in Southwest."}}
{"id": "m007", "message": "Reminder: Building maintenance will shut off water to floors 5-8 tomorrow between 9 AM and 12 PM for pipe repairs. Please plan accordingly. Restrooms on floors 4 and 9 will remain available. Contact Property Management at ext. 3040 with questions.", "reference": {"tldr": "Water shut off floors 5-8 tomorrow 9 AM-12 PM for pipe repairs."}}
{"id": "m008", "message": "Hey Sarah, thanks for covering my shift last week! I owe you one. Are you still interested in swapping shifts next Friday? I have a family wedding and need the day off. Let me know if that works for you. Thanks again!", "reference": {"tldr": "Asking Sarah to swap shifts next Friday due to family wedding."}}
{"id": "m009", "message": "Customer #45892 submitted a refund request for order #ORD-18374. They received the wrong size (Medium instead of Large) and the color doesn't match the website photo. Shipping label has been emailed. Please process refund once item is received and inspected. Original payment: $87.99 via PayPal.", "reference": {"tldr": "Customer 45892 refund request for order 18374, wrong size and color."}}
{"id": "m010", "message": "The new hire orientation is scheduled for Monday, January 15th at 10 AM in the Training Center. We have 8 new employees starting: 3 in Engineering, 2 in Sales, 2 in Customer Support, and 1 in HR. Please have all laptops configured and access badges ready by Friday.", "reference": {"tldr": "New hire orientation January 15th 10 AM, 8 employees, prep laptops and badges."}}
{"id": "m011", "message": "Quick update on the Martinez account: they've agreed to the revised contract terms and signed this morning. Annual value increased from $240K to $285K with the added consulting services. Implementation starts February 1st. Great work team!", "reference": {"tldr": "Martinez account signed revised contract, value increased from 240K to 285K."}}
{"id": "m012", "message": "IMPORTANT: Security audit identified 23 user accounts with passwords older than 90 days. Password reset required by Friday, January 12th. Accounts will be automatically locked if not updated. Please check your email for the reset link and follow instructions.", "reference": {"tldr": "23 accounts need password reset by Friday Jan 12th or will be locked."}}
{"id": "m013", "message": "Hey, I left my laptop charger in Conference Room C after yesterday's presentation. It's a black Dell charger with my initials 'JM' written on the cable with silver marker. If anyone sees it, can you please let me know? Thanks!", "reference": {"tldr": "Left black Dell laptop charger with initials JM in Conference Room C."}}
{"id": "m014", "message": "Flight BA 2847 from London Heathrow landing at 6:45 PM tonight, Terminal 5. I'll grab my bags and meet you at the pickup area near Door 7. Should be there by 7:15 PM unless customs is backed up. Text me when you're close!", "reference": {"tldr": "Flight BA 2847 lands 6:45 PM Terminal 5, meet at Door 7 by 7:15 PM."}}
{"id": "m015", "message": "The website migration is complete! All 347 pages have been moved to the new server without issues. DNS propagation will take 24-48 hours. Monitor the uptime dashboard and let me know immediately if you notice any broken links or missing images.", "reference": {"tldr": "Website migration complete, 347 pages moved, DNS propagation takes 24-48 hours."}}
{"id": "m016", "message": "Dr. Chen's office called to confirm your dental cleaning appointment on March 8th at 2:00 PM. They're running a promotion on teeth whitening - $200 off if booked with cleaning. Also, they need your updated insurance information before the visit.", "reference": {"tldr": "Dental cleaning confirmed March 8th 2 PM, bring updated insurance info."}}
{"id": "m017", "message": "Package from Amazon delivered to front porch at 3:47 PM. Tracking shows it required signature but driver left it anyway. The box looks a bit damaged on one corner. Order #114-8847392-1847382. Let me know if everything arrived okay.", "reference": {"tldr": "Amazon package delivered at 3:47 PM to porch, box slightly damaged."}}
{"id": "m018", "message": "Team lunch is rescheduled from Tuesday to Wednesday at 12:30 PM. We're trying that new Italian place, Bella Vista, on 5th Avenue. Mike is making reservations for 12 people. Please confirm attendance by EOD Monday so we have accurate headcount.", "reference": {"tldr": "Team lunch moved to Wednesday 12:30 PM at Bella Vista, confirm by Monday."}}
{"id": "m019", "message": "Code review for PR #842 is complete. Found 3 minor issues: missing error handling in the payment module, inconsistent variable naming in user service, and a potential SQL injection vulnerability in the search function. Please address these before merging to main.", "reference": {"tldr": "PR 842 code review found 3 issues: error handling, naming, SQL injection."}}
{"id": "m020", "message": "Your prescription is ready for pickup at Walgreens on Oak Street. Pharmacy closes at 9 PM tonight. Make sure to bring your insurance card. Total cost after insurance: $15.00. Refills available: 2. Next refill date: February 20th.", "reference": {"tldr": "Prescription ready at Walgreens Oak Street, costs 15 dollars after insurance."}}
{"id": "m021", "message": "Power outage reported in Building A, affecting floors 1-4. Backup generators kicked in but email and phones may be intermittent. Estimated restoration time is 2 hours. Non-essential staff can work from home if needed. Updates will be posted on the intranet.", "reference": {"tldr": "Power outage Building A floors 1-4, backup generators on, 2 hour restoration."}}
{"id": "m022", "message": "Contract negotiation with Acme Corp hit a snag. They want Net 60 payment terms instead of our standard Net 30. Legal is reviewing but recommends we hold firm unless they increase order volume by 25%. Meeting scheduled for Thursday to discuss.", "reference": {"tldr": "Acme Corp wants Net 60 terms, Legal recommends holding at Net 30."}}
{"id": "m023", "message": "Congratulations! Your application for the Senior Developer position has been selected for the final interview round. We'd like to schedule a panel interview with the Engineering Director and two team leads. Please reply with your availability for next week, preferably Tuesday through Thursday.", "reference": {"tldr": "Selected for final interview for Senior Developer, provide availability Tuesday-Thursday next week."}}
{"id": "m024", "message": "Rent payment of $2,450 was received on January 3rd, 2 days late. Late fee of $75 has been applied per lease agreement section 4.2. Total amount due: $2,525. Please ensure future payments are submitted by the 1st of each month to avoid additional fees.", "reference": {"tldr": "Rent received late, 75 dollar late fee applied, total due 2525 dollars."}}
{"id": "m025", "message": "Your car is ready for pickup. We completed the oil change, tire rotation, and brake inspection. Front brake pads were replaced as they were below minimum thickness. Total service cost: $387.50. We're open until 6 PM today or anytime tomorrow after 8 AM.", "reference": {"tldr": "Car ready for pickup, oil change and brake pads replaced, cost 387.50 dollars."}}
{"id": "m026", "message": "Survey results are in from the employee satisfaction survey. Overall score improved from 6.8 to 7.4 out of 10. Work-life balance and benefits rated highest. Management communication and career development opportunities need improvement. Full report attached.", "reference": {"tldr": "Employee satisfaction improved from 6.8 to 7.4, management communication needs work."}}
{"id": "m027", "message": "Gym membership auto-renewal is coming up on January 31st. Current plan: Premium Plus at $89/month. We're offering an upgrade to Platinum with personal training sessions for $119/month. Reply UPGRADE to switch or CANCEL to terminate membership.", "reference": {"tldr": "Gym membership auto-renews January 31st at 89 dollars monthly, upgrade available."}}
{"id": "m028", "message": "Project Falcon is 3 weeks behind schedule. Development team cites scope creep and unclear requirements from stakeholders. Suggest we freeze new feature requests and focus on MVP delivery. Emergency stakeholder meeting requested for tomorrow at 10 AM.", "reference": {"tldr": "Project Falcon 3 weeks behind due to scope creep, emergency meeting tomorrow."}}
{"id": "m029", "message": "Your Amazon order has shipped! Tracking number: 1Z999AA1234567890. Estimated delivery: Wednesday, January 10th between 10 AM - 2 PM. Carrier: UPS. Package contains: Wireless Mouse (Black), USB-C Cable (6ft), Laptop Stand (Aluminum). Track your package at ups.com.", "reference": {"tldr": "Amazon order shipped via UPS, arrives Wednesday Jan 10th between 10 AM-2 PM."}}
{"id": "m030", "message": "Lab results from your January 4th blood work are available in the patient portal. Dr. Martinez will call you tomorrow to discuss the findings and next steps. Please log in to review the results before the call. If you have urgent questions, call the office at 555-0123.", "reference": {"tldr": "Lab results available in portal, doctor calls tomorrow to discuss findings."}}
{"id": "m031", "message": "Office closure alert: All offices will be closed Monday, January 15th for Martin Luther King Jr. Day. Regular business hours resume Tuesday, January 16th at 8 AM. Emergency support line remains available 24/7 at 1-800-555-0199.", "reference": {"tldr": "Offices closed Monday January 15th for MLK Day, reopen Tuesday 8 AM."}}
{"id": "m032", "message": "WiFi network CORP-GUEST will be down for maintenance Sunday from 2 AM to 6 AM. Main employee network CORP-SECURE is not affected. Mobile hotspots available from IT if needed. Contact help desk at ext. 2000 for assistance.", "reference": {"tldr": "Guest WiFi down Sunday 2-6 AM for maintenance, employee network unaffected."}}
{"id": "m033", "message": "Your Uber ride to 450 Market Street is arriving in 3 minutes. Driver: Michael in a silver Honda Accord, license plate 7ABC123. Current location: 0.2 miles away. Total fare estimate: $18-22. Rate your ride to earn points.", "reference": {"tldr": "Uber arriving in 3 minutes, Michael in silver Honda Accord, fare 18-22 dollars."}}
{"id": "m034", "message": "Quarterly tax payment of $4,200 is due January 15th. I've prepared the payment voucher and it's ready for your signature. We can either mail it or submit electronically through EFTPS. Electronic submission is recommended to ensure timely receipt. Let me know your preference.", "reference": {"tldr": "Quarterly tax payment 4200 dollars due January 15th, electronic submission recommended."}}
{"id": "m035", "message": "Welcome to your new home! Here are your keys and access codes. Garage code: 4782, Front door keypad: 8394. Trash pickup is every Tuesday and Friday morning. HOA meeting is the first Thursday of each month at 7 PM in the clubhouse. Our direct number is 555-0156 if you need anything.", "reference": {"tldr": "New home keys and codes provided, trash Tuesdays and Fridays, HOA first Thursday."}}
{"id": "m036", "message": "Flight status update: Your flight UA 1847 from Chicago to Seattle is delayed 45 minutes due to weather. New departure time: 5:35 PM. Gate remains C24. Complimentary meal vouchers available at the gate for inconvenience. Estimated arrival in Seattle: 8:20 PM local time.", "reference": {"tldr": "Flight UA 1847 delayed 45 minutes, new departure 5:35 PM, arrival 8:20 PM."}}
{"id": "m037", "message": "Performance review completed. Overall rating: Exceeds Expectations. Strengths: technical expertise, teamwork, problem-solving. Areas for development: presentation skills, delegation. Salary increase of 5.5% effective February 1st. Promotion to Senior Analyst recommended for Q3 review. Great job this year!", "reference": {"tldr": "Performance review exceeds expectations, 5.5% raise February 1st, promotion recommended Q3."}}
{"id": "m038", "message": "Pest control will be servicing the building next Wednesday, January 17th between 8 AM and 5 PM. Please ensure all food is sealed and stored properly. Remove pet bowls and cover fish tanks. No need to vacate - treatment is pet and child safe once dry. Contact office with concerns.", "reference": {"tldr": "Pest control Wednesday January 17th 8 AM-5 PM, seal food and remove pet bowls."}}
{"id": "m039", "message": "Book club meeting this Saturday at 3 PM at Janet's house. We're discussing 'The Midnight Library' by Matt Haig. Bring a snack to share and your discussion notes. Janet's address: 742 Evergreen Terrace. Street parking available. RSVP to confirm attendance.", "reference": {"tldr": "Book club Saturday 3 PM at Janet's, discussing Midnight Library, bring snack."}}
{"id": "m040", "message": "Credit card ending in 4829 has suspicious activity: $847.99 charge from Electronics Warehouse in Miami on January 5th. If you recognize this charge, no action needed. If unauthorized, reply FRAUD immediately and we'll freeze the card and issue a replacement. Reference case #CC-4829-0105.", "reference": {"tldr": "Suspicious 847.99 dollar charge on card 4829, reply FRAUD if unauthorized."}}
{"id": "m041", "message": "Congratulations! Your loan application for $35,000 has been approved. Interest rate: 6.25% APR, Term: 60 months, Monthly payment: $679. First payment due March 1st, 2024. Funds will be deposited to your account within 2-3 business days. Documents will arrive by mail for your records.", "reference": {"tldr": "35000 dollar loan approved at 6.25% APR, 679 monthly payment for 60 months."}}
{"id": "m042", "message": "Reminder: Annual fire safety training is mandatory for all employees. Sessions available Tuesday and Wednesday this week at 10 AM, 2 PM, and 4 PM in the main auditorium. Each session is 45 minutes. Sign up on the HR portal. Failure to attend may result in access restrictions.", "reference": {"tldr": "Mandatory fire safety training Tuesday and Wednesday, sign up on HR portal."}}
{"id": "m043", "message": "Your package has been delivered and left at the front desk with security guard Marcus. Signature was required per sender instructions. Delivered at 11:23 AM on January 8th. Package description: Medium box from Johnson Medical Supplies. Please bring ID when picking up.", "reference": {"tldr": "Package delivered to front desk with Marcus at 11:23 AM, bring ID."}}
{"id": "m044", "message": "System upgrade scheduled for Saturday, January 13th from 11 PM to 5 AM Sunday. All services including email, file storage, and CRM will be unavailable. Please save your work and log out by 10:45 PM Saturday. System testing will occur Sunday morning before go-live.", "reference": {"tldr": "System upgrade Saturday 11 PM to Sunday 5 AM, all services unavailable."}}
{"id": "m045", "message": "Your subscription to Premium Streaming expires in 7 days on January 15th. Renewal price: $14.99/month. Your saved card ending in 1847 will be charged automatically unless you cancel. Manage subscription in account settings or call 1-888-555-0177. Thank you for being a member!", "reference": {"tldr": "Premium Streaming subscription renews January 15th at 14.99 monthly, auto-charge card 1847."}}
{"id": "m046", "message": "Team standup summary: Alex completed the authentication module, Jessica is 80% done with the dashboard redesign (delayed by API issues), Mike started on the payment integration. Blockers: Need staging environment access for testing. Next standup: Tomorrow 9:30 AM.", "reference": {"tldr": "Alex done with auth, Jessica 80% on dashboard, need staging environment access."}}
{"id": "m047", "message": "Property tax bill for 2024 is now available online. Total amount: $6,847.50. Payment options: Pay in full by April 1st for 2% discount ($6,710.55) or split into two installments (April 1st and September 1st). Pay online, by mail, or in person at County Treasurer's office.", "reference": {"tldr": "2024 property tax 6847.50 dollars, 2% discount if paid in full by April 1st."}}
{"id": "m048", "message": "Congratulations on your graduation! Your diploma will be mailed to the address on file within 4-6 weeks. Official transcripts can be ordered through the Registrar's Office website for $15 each. Alumni benefits activate immediately - check out career services and networking events. Go Tigers!", "reference": {"tldr": "Diploma mails in 4-6 weeks, official transcripts 15 dollars each, alumni benefits active."}}
{"id": "m049", "message": "Veterinary appointment reminder for Buddy on Thursday, January 11th at 3:00 PM. Annual checkup, vaccinations, and heartworm test. Please bring previous vaccination records if available. Estimated cost: $185-220. We're at 890 Pet Care Lane, Suite B. Call 555-0134 to reschedule if needed.", "reference": {"tldr": "Buddy's vet appointment Thursday January 11th 3 PM, checkup and vaccines, cost 185-220 dollars."}}
{"id": "m050", "message": "Job offer extended! Position: Marketing Manager, Salary: $92,000/year, Start date: February 19th. Benefits include health insurance, 401k matching, 15 days PTO. Offer expires January 20th. Please review attached documents and return signed acceptance by deadline. Welcome aboard!", "reference": {"tldr": "Marketing Manager job offer 92000 yearly, starts February 19th, accept by January 20th."}}

