{"id": "m001", "message": "Hey team, just a quick reminder that the Q4 budget meeting is scheduled for Thursday at 2 PM in Conference Room B. Please bring your department's spending reports and be prepared to discuss next quarter's projections. Sarah from Finance will be leading the discussion.", "reference": {"tldr": "Q4 budget meeting Thursday 2 PM in Conference Room B, bring spending reports."}}
{"id": "m002", "message": "Hi, I'm having trouble logging into my account. Every time I enter my password, it says 'Invalid credentials' even though I'm sure it's correct. I tried resetting it twice but I'm not receiving the reset email. Can someone from IT help me? This is urgent as I need to access the client files by end of day.", "reference": {"tldr": "Cannot login, password reset emails not arriving, need urgent IT help for client files."}}
{"id": "m003", "message": "Good morning! The coffee machine on the 10th floor stopped dispensing hot water again. This is the third time this month. Can someone from Facilities please take a look? The Quench filter was replaced in July, so it might be a different issue. Thanks!", "reference": {"tldr": "10th floor coffee machine not dispensing hot water, third occurrence this month."}}
{"id": "m004", "message": "Mom called - Dad's doctor appointment moved to next Tuesday at 3:30 PM instead of Wednesday. She wants you to drive them since her car is in the shop. Also, pick up his prescription from CVS on Main Street before you come over.", "reference": {"tldr": "Dad's appointment moved to Tuesday 3:30 PM, need to drive and get prescription."}}
{"id": "m005", "message": "URGENT: Production server DB-PROD-01 is showing high memory usage (92%) and response times have degraded to 8-10 seconds. Multiple customer complaints coming in. I've restarted the cache service but no improvement. Need DevOps on this ASAP. Incident ticket #INC-2847 created.", "reference": {"tldr": "Production server at 92% memory, slow response, customer complaints, ticket INC-2847 created."}}
